In [1]:
import pandas as pd
import numpy as np  
import seaborn as sns
import plotly.express as px

In [2]:
# Importing the data / Leitura dos dados

url_rest_data_log = 'https://raw.githubusercontent.com/RafaelGenari/Bootcamp-Project-Report_History_with_Data/refs/heads/main/rest_data_us_upd.csv'

rest_log = pd.read_csv(url_rest_data_log, sep = ',')

In [3]:
rest_log.info()
print()
rest_log.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           9651 non-null   int64
 1   object_name  9651 non-null   object
 2   address      9651 non-null   object
 3   chain        9648 non-null   object
 4   object_type  9651 non-null   object
 5   number       9651 non-null   int64
dtypes: int64(2), object(4)
memory usage: 452.5+ KB

                 id       number
count   9651.000000  9651.000000
mean   16611.000000    43.695161
std     2786.148058    47.622874
min    11786.000000     1.000000
25%    14198.500000    14.000000
50%    16611.000000    27.000000
75%    19023.500000    46.000000
max    21436.000000   229.000000

In [4]:
rest_log.head()

,id,object_name,address,chain,object_type,number
0,11786,HABITAT COFFEE SHOP,3708 N EAGLE ROCK BLVD,False,Cafe,26
1,11787,REILLY'S,100 WORLD WAY 120,False,Restaurant,9
2,11788,STREET CHURROS,6801 HOLLYWOOD BLVD 253,False,Fast Food,20
3,11789,TRINITI ECHO PARK,1814 W SUNSET BLVD,False,Restaurant,22
4,11790,POLLEN,2100 ECHO PARK AVE,False,Restaurant,20

In [5]:
rest_log['id'] = rest_log['id'].astype(str)
rest_log.rename(columns = {'number': 'seats_number'}, inplace = True)

In [6]:
rest_log.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9651 entries, 0 to 9650
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            9651 non-null   object
 1   object_name   9651 non-null   object
 2   address       9651 non-null   object
 3   chain         9648 non-null   object
 4   object_type   9651 non-null   object
 5   seats_number  9651 non-null   int64
dtypes: int64(1), object(5)
memory usage: 452.5+ KB

In [7]:
# trocar number para seats_number